PhanLeSon03/Mic_Array/STM32F746_Mic_Array_Eclipse/src/main.c
			}
			AudioPlayerUpd();
	       //HAL_GPIO_TogglePin(GPIOA, GPIO_PIN_15);
	  }
	 

}


inline static void Audio_Play_Out(void)
{

/*-------------------------------------------------------------------------------------------------------------
			  
	Sequence  Record Data                     Processing Data                 Player Data
			  
	1-------  Buffer1                         Buffer2                          Buffer3
			  
	2-------  Buffer3                         Buffer1                           Buffer2		  
			  
	3-------  Buffer2                         Buffer3                           Buffer1 
 ---------------------------------------------------------------------------------------------------------------*/
    //Audio_MAL_Play((uint32_t)&bufferSum[idxFrmPDMMic8*AUDIO_CHANNELS*(6*AUDIO_SAMPLING_FREQUENCY/1000)], 2*6*AUDIO_CHANNELS*(AUDIO_SAMPLING_FREQUENCY/1000));
    //Audio_MAL_Play((uint32_t)&bufferSum, 2*3*AUDIO_CHANNELS*AUDIO_OUT_BUFFER_SIZE);
    flgRacing=0;

#if USB_STREAMING
				  AudioUSBSend(idxFrmPDMMic8);
#endif


    ++idxFrmPDMMic8;
	/* if player is finished for curent buffer                                  */ 
	if (idxFrmPDMMic8 == AUDIO_OUT_BUFFER_SIZE/(AUDIO_SAMPLING_FREQUENCY/1000))
	{
	       RESET_IDX
		   //MIC7Rec();
		   //MIC8Rec();
           WaveRec_idxTest=0;
           idxFrmPDMMic8=0;
            switch (buffer_switch)
            {
                case BUF1_PLAY:
                      /* set flag for switch buffer */		  
                  buffer_switch = BUF3_PLAY;
                  break;
                case BUF2_PLAY:
                  /* set flag for switch buffer */
                  buffer_switch = BUF1_PLAY;        
                  break;
                case BUF3_PLAY:
                  /* set flag for switch buffer */		  
                  buffer_switch = BUF2_PLAY;
                  break;
                default:
                  break;
            }

          //if (cntStrt==2) 	 StartRecMic7_8();
          if (cntStrt<20) 
          {  
              cntStrt++;
              WaveRecord_flgIni=0; 
          }

		 /* Tongle status to switch the USB audio buffer out */

	}			 



}


/* Private functions ---------------------------------------------------------*/

/**
  * @brief  Main program
  * @param  None
  * @retval None
  */
int main(void)
{
  /* Enable the CPU Cache */
  CPU_CACHE_Enable();
  
  /* STM32F7xx HAL library initialization:
       - Configure the Flash ART accelerator on ITCM interface
       - Configure the Systick to generate an interrupt each 1 msec
       - Set NVIC Group Priority to 4
       - Global MSP (MCU Support Package) initialization
     */   
  HAL_Init();
  /* Configure the system clock to 216 MHz */
  //Test_SystemClock_Config(); 
  SystemClock_Config();
  BSP_AUDIO_OUT_ClockConfig(3*AUDIO_FREQ, NULL);
#if EXT_RAM  
  /* Initialize the SDRAM */
  BSP_SDRAM_Init();
#endif
  BSP_LED_Init(LED1);
  BSP_LED_Init(LED2);

  /* Button Initialization */
  // sop1hc: removed on 22 June 2016, since do not install 2 buttons on this version 
  //ButtonInit();

  //BSP_PB_Init(BUTTON_KEY,BUTTON_MODE_EXTI);


  /* Init TS module */
   DFT_Init();
   FactorUpd(&FacMic);


    /*-----------------------*/
	/* ---------PA4: LCCKO(I2S2)-------------*/
    __GPIOA_CLK_ENABLE();
    GPIO_INS.Pin = GPIO_PIN_4;
    GPIO_INS.Mode =GPIO_MODE_INPUT;
    GPIO_INS.Pull =GPIO_PULLUP;
    GPIO_INS.Speed =GPIO_SPEED_HIGH;
    HAL_GPIO_Init(GPIOA,&GPIO_INS);

    /* Enable and set Button EXTI Interrupt to the lowest priority */
    //HAL_NVIC_SetPriority((IRQn_Type)EXTI4_IRQn, INTERRUPT_PRI_EXT_LRCK, 0);
    //HAL_NVIC_EnableIRQ((IRQn_Type)EXTI4_IRQn);

     /* ---------PB12: LCCKO (I2S2)-------------*/
    __GPIOB_CLK_ENABLE();
    GPIO_INS.Pin = GPIO_PIN_12;
    GPIO_INS.Mode =GPIO_MODE_INPUT;
    GPIO_INS.Pull =GPIO_PULLUP;
    GPIO_INS.Speed =GPIO_SPEED_HIGH;
    HAL_GPIO_Init(GPIOB,&GPIO_INS);
    /*-----------------------------------------*/

    /* ---------PE4: LCCKO --------------------*/
    __GPIOE_CLK_ENABLE();
    GPIO_INS.Pin = GPIO_PIN_4;
    GPIO_INS.Mode =GPIO_MODE_INPUT;
    GPIO_INS.Pull =GPIO_PULLUP;
    GPIO_INS.Speed =GPIO_SPEED_HIGH;
    HAL_GPIO_Init(GPIOE,&GPIO_INS);
    /*-----------------------------------------*/

    /*---------PE3: POWER DOWN-----------------*/
    __GPIOE_CLK_ENABLE();
    GPIO_INS.Pin = GPIO_PIN_3;
    GPIO_INS.Mode = GPIO_MODE_OUTPUT_PP;
    GPIO_INS.Pull = GPIO_PULLUP;
    GPIO_INS.Speed = GPIO_SPEED_HIGH;

    HAL_GPIO_Init(GPIOE, &GPIO_INS);

    HAL_GPIO_WritePin(GPIOE, GPIO_PIN_3, GPIO_PIN_RESET);
    //HAL_Delay(300);
    /*----------------------------------------*/

#if (DEBUG_SER)
    /* UART for debug */
    USART3_Init();
#endif

#if (USB_STREAMING)
		/* Initialize USB descriptor basing on channels number and sampling frequency */
		USBD_AUDIO_Init_Microphone_Descriptor(&hUSBDDevice, 4*AUDIO_SAMPLING_FREQUENCY, AUDIO_CHANNELS);
		/* Init Device Library */
		USBD_Init(&hUSBDDevice, &AUDIO_Desc, 0);
		/* Add Supported Class */
		USBD_RegisterClass(&hUSBDDevice, &USBD_AUDIO);
		/* Add Interface callbacks for AUDIO Class */
		USBD_AUDIO_RegisterInterface(&hUSBDDevice, &USBD_AUDIO_fops);
		/* Start Device Process */
		USBD_Start(&hUSBDDevice);

		/* Init Host Library */
		//test GIT //USBH_Init(&hUSBHost, USBH_UserProcess, 0);

		/* Add Supported Class */
		//test GIT //USBH_RegisterClass(&hUSBHost, USBH_MSC_CLASS);

		/* Start Host Process */
		//test GIT //USBH_Start(&hUSBHost);
#endif


    AUDIO_InitApplication();
    __disable_irq();
     /*------------------------PLAYER------------------------------------------*/
    Audio_MAL_Play((uint32_t)bufferSum,6*AUDIO_CHANNELS*(AUDIO_SAMPLING_FREQUENCY/1000));
    /*------------------------------------------------------------------------*/


    /*----------------------------------------*/
    MX_I2C2_Init(); //for STA321MP
    STA321MP_Ini();
    BSP_LED_Toggle(LED1);
    /* Init Audio Application */
#ifdef CS43L22_PLAY
    AUDIO_InitApplication();
#endif
    BSP_LED_Toggle(LED2);

