PhanLeSon03/Mic_Array/STM32F746_Mic_Array_Eclipse/src/main.c
    buffer_switch = BUF3_PLAY;		 /* record data to buffer1 */


    MIC1TO8_Init();
    StartPlay();
    __enable_irq();
    BSP_LED_Toggle(LED1);

    //Window(fir256Coff);
	//EnergyNoiseCalc(AUDIO_OUT_BUFFER_SIZE/2);
    //Precalculation(Coef,PreCalcBuff);

    while (1)
    {
		/* This calculation happens once time in power cycles */
		/* After 5 times of full frame recieved interrupt */

        if ((cntStrt>=5)&&(cntStrt<20))
        {
            if ((WaveRecord_flgIni<900)&&(cntStrt<10))
            {
                if (ValBit(SPI4_stNipple,0)!=0)
                {
                    swtCase1Mic56 = 1;
                }
                WaveRecord_flgIni++;
            }
            else if ((WaveRecord_flgIni<1000)&&(cntStrt<10))
            {
                if (swtCase1Mic56==0)
                {
                     stMIC56 = GPIO_PIN_SET;
                     stMIC56Old = GPIO_PIN_SET;
                     SPI4_stPosShft = 0;
                }

                WaveRecord_flgIni++;


            }
            else if ((cntStrt==10)&&(WaveRecord_flgIni<200))
            {
                for(char i=0;i<16;i++)
                {
                     if (ValBit(SPI4_stNipple,i)!=0)
                     {
                          SPI4_stPosShft = MAX(SPI4_stPosShft,i+1);
                     }
                }

                if (SPI4_stPosShft==16)  HAL_NVIC_SystemReset();

                WaveRecord_flgIni++;
            }
            else
            {
                flgShipping = 0;
                WaveRecord_flgIni = 0;
            }


		 }


		/* USB Host Background task */
		//USBH_Process(&hUSBHost);

		/* AUDIO Menu Process */
		//AUDIO_MenuProcess();

		FFT_Update();

		if (flg10ms==1)
		{
		    flg10ms=0;
	         cntTime200++;
	         if (cntTime200==40)
	         {

#if (DEBUG_SER)
                   uint32_t tmpSNR63,tmpSNR14,tmpSNR78,tmpSNR25;
                   tmpSNR78 = (uint32_t)(CrssCorVal78/EnergyError);
                   tmpSNR25 = (uint32_t)(CrssCorVal25/EnergyError);
				   tmpSNR14 = (uint32_t)(CrssCorVal14/EnergyError);
				   tmpSNR63 = (uint32_t)(CrssCorVal63/EnergyError);
                    //if (tmpSNR>10)
                    {
                        int16_t test[5];
                        static uint8_t flagNotMin;
                        test[0] = 0;
						if (CrssCorVal63>10)
                            test[1]= idxLatency63;
						else
							test[1] = 0;

						if (CrssCorVal14>10)
                            test[2]= idxLatency14;
						else
							test[2] =0;

						if (CrssCorVal25 > 10)
                            test[3]= idxLatency25;
						else
							test[3] = 0;

                        if (CrssCorVal78>10)
						    test[4]= idxLatency78;
						else
							test[4]= 2;

						if (((CrssCorVal63>10))||((CrssCorVal14>10))||((CrssCorVal25>10))||((CrssCorVal78>10)))
                        {
                             sprintf((char *)pUARTBuf,"%d:%d:%d:%d  ",idxLatency63,idxLatency14,idxLatency25,idxLatency78);
                             flagNotMin=0 ;
                              sprintf((char *)(pUARTBuf+15),"----------\r\n");
                              if (test[3]>0)
                              {
                                      sprintf((char *)(pUARTBuf+15),"Close Mic 5\r\n");
									  flagNotMin=1;
                              }
                              else if (test[3]<0)
                              {
                                    sprintf((char *)(pUARTBuf+15),"Clsoe Mic 2\r\n");
									flagNotMin=1;

                              }
                              else
                              {

                              }


				                if (test[2]>0)
		                  	    {
		                  	       if((CrssCorVal14>CrssCorVal25)||(flagNotMin==0))
		                  	       {
		                             sprintf((char *)(pUARTBuf+15),"Clsoe Mic 4\r\n");
									 flagNotMin=2;
		                  	       }
		                  	    }
		                        else if (test[2]<0)
		                        {
		                            if((CrssCorVal14>CrssCorVal25)||(flagNotMin==0))
		                            {
		                              sprintf((char *)(pUARTBuf+15),"Clsoe Mic 1\r\n");
									  flagNotMin=2;
		                            }
		                        }
		                        else
		                        {

		                        }


		                        if (test[1]>0)
		                  	    {
		                  	       if((((CrssCorVal63>CrssCorVal25)&&(flagNotMin==1))||(flagNotMin==0))||((CrssCorVal63>CrssCorVal14)&&(flagNotMin==2)))
		                  	       {
								     sprintf((char *)(pUARTBuf+15),"Clsoe Mic 3\r\n");
								     flagNotMin=3;
		                  	       }
		                  	    }
		                        else if (test[1]<0)
		                        {
		                             if((((CrssCorVal63>CrssCorVal25)&&(flagNotMin==1))||(flagNotMin==0))||((CrssCorVal63>CrssCorVal14)&&(flagNotMin==2)))
		                             {
		                               sprintf((char *)(pUARTBuf+15),"Clsoe Mic 6\r\n");
									   flagNotMin=3;
		                             }
		                        }
		                        else
		                        {

		                        }


	                            if ((test[4]>3))
	                            {
	                                if ((flagNotMin==0))
	                                    sprintf((char *)(pUARTBuf+15),"Clsoe Mic 7\r\n");
								    else if ((flagNotMin==1))
										if ((CrssCorVal78>CrssCorVal25))
											sprintf((char *)(pUARTBuf+15),"Clsoe Mic 7\r\n");
								    else if ((flagNotMin==2))
										if ((CrssCorVal78>CrssCorVal14))
											sprintf((char *)(pUARTBuf+15),"Clsoe Mic 7\r\n");
								    else if ((flagNotMin==3))
										if ((CrssCorVal78>CrssCorVal63))
											sprintf((char *)(pUARTBuf+15),"Clsoe Mic 7\r\n");
									else
										;

