PhanLeSon03/Mic_Array/STM32F746_Mic_Array_Eclipse/src/main.c
}


void ButtonInit(void)
{
  /* PI8: SW2 */
  /* PI9: SW1 */
  /* ----------------------*/
  __GPIOB_CLK_ENABLE();
  GPIO_INS.Pin = GPIO_PIN_8|GPIO_PIN_9;
  GPIO_INS.Mode =GPIO_MODE_IT_RISING;
  GPIO_INS.Pull =GPIO_NOPULL;
  GPIO_INS.Speed =GPIO_SPEED_HIGH;
  HAL_GPIO_Init(GPIOI,&GPIO_INS);

  /* Enable and set Button EXTI Interrupt to the lowest priority */
  HAL_NVIC_SetPriority((IRQn_Type)EXTI9_5_IRQn, 0x0F, 0x00);
  HAL_NVIC_EnableIRQ((IRQn_Type)EXTI9_5_IRQn);
  /*-----------------------*/
}


/* I2C2 init function */
void MX_I2C2_Init(void)
{
  __HAL_I2C_DISABLE(&hi2c2);
  hi2c2.Instance = I2C2;
  hi2c2.Init.Timing =0x00A0689A ;//I2C_TIMING  0x00303D5D 0x00A0689A
  hi2c2.Init.OwnAddress1 = 0;
  hi2c2.Init.AddressingMode = I2C_ADDRESSINGMODE_7BIT;
  hi2c2.Init.DualAddressMode = I2C_DUALADDRESS_DISABLE;
  hi2c2.Init.OwnAddress2 = 0;
  hi2c2.Init.OwnAddress2Masks = I2C_OA2_NOMASK;
  hi2c2.Init.GeneralCallMode = I2C_GENERALCALL_DISABLE;
  hi2c2.Init.NoStretchMode = I2C_NOSTRETCH_DISABLE;
  HAL_I2C_Init(&hi2c2);

  /**Configure Analogue filter 
  */
  //HAL_I2CEx_AnalogFilter_Config(&hi2c2, I2C_ANALOGFILTER_ENABLE);

}

 void HAL_I2S_TxCpltCallback(I2S_HandleTypeDef *hi2s)
{  
  //Audio_Play_Out();  
  #if (AUDIO_OUT_STREAM_NORMAL)
      Audio_MAL_Play((uint32_t)&bufferSum[(6*AUDIO_SAMPLING_FREQUENCY/1000)], 6*AUDIO_CHANNELS*(AUDIO_SAMPLING_FREQUENCY/1000));
  #else

  #endif  

  
}

 uint8_t StartPlay(void)
 {
 #if 0
	while (1)
	{
		 /* there is data in the buffer */	
		 if((WaveRec_idxSens1>=(AUDIO_OUT_BUFFER_SIZE-1))&&(stFrstFrmStore<3))
		 {
			 RESET_IDX
			 /* this is just run 1 time after 1st frame of I2S data full */
			 if ((stFrstFrmStore<3))
			 {
                             stFrstFrmStore++;
             
                             buffer_switch = BUF2_PLAY; /* record data to buffer3 */
             
                             if (stFrstFrmStore==2)
                             {
                                 
         
                                 /*------------------------PLAYER------------------------------------------*/
                                 Audio_MAL_Play((uint32_t)bufferSum,2*6*AUDIO_CHANNELS*(AUDIO_SAMPLING_FREQUENCY/1000));
                                 /*------------------------------------------------------------------------*/				 
                                 buffer_switch = BUF1_PLAY;
								 uint16_t tdelay=100;
								 while(tdelay--);
                                 //StartRecMic7_8();
                                 return 0;		 
                             }				 
                     
			 }
		 
		 }
	}
#endif	

    	   	 
    //HAL_Delay(100);
    	
    //HAL_Delay(1);
    //for (uint32_t i=0; i<2000;i++)
    //{
    //  __NOP;
    //  __NOP;
    //  __NOP;
    //  __NOP;
    //}
    //while(HAL_GPIO_ReadPin(GPIOA, GPIO_PIN_4)==GPIO_PIN_SET);
    //while(HAL_GPIO_ReadPin(GPIOA, GPIO_PIN_4)==GPIO_PIN_RESET);
    
    I2S1_Enable();
    I2S2_Enable();
    SPI4_Enable();
    StartRecMic7_8();
    WaveRec_idxSens1 = 0;
    WaveRec_idxSens2 = 0;
    WaveRec_idxSens3 = 0;
    WaveRec_idxSens4 = 0;
    WaveRec_idxSens5 = 0;
    WaveRec_idxSens6 = 0; 
    idxFrmPDMMic8 = 0;
    buffer_switch = BUF1_PLAY;

	return 0;
	 
 }

void SubFrameFinished(void)
{
    Audio_Play_Out();
}
/*****************************END OF FILE**************************************/
